benchmark/report/rps/full/20260804_164246/raw/007_auth_me_c1_r1.txt
Running 20s test @ http://127.0.0.1:32781/api/auth/me
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.60ms    0.97ms  21.71ms   76.00%
    Req/Sec   381.17     93.36   770.00     81.50%
  Latency Distribution
     50%    2.55ms
     75%    3.09ms
     90%    3.67ms
     99%    5.19ms
  7613 requests in 20.06s, 5.21MB read
Requests/sec:    379.49
Transfer/sec:    266.08KB
HPS_WRK_REQUESTS 7613
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 7613
HPS_STATUS_2XX 7613
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 200=7613