benchmark/report/rps/full/20260804_164246/raw/028_upload_1mb_c2_r1.txt
Running 5s test @ http://127.0.0.1:32781/api/files/upload
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   108.56ms   29.21ms 192.38ms   70.37%
    Req/Sec     2.37      0.56     3.00     55.56%
  Latency Distribution
     50%  111.06ms
     75%  122.27ms
     90%  125.58ms
     99%  192.38ms
  27 requests in 5.04s, 16.61KB read
Requests/sec:      5.36
Transfer/sec:      3.30KB
HPS_WRK_REQUESTS 27
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 27
HPS_STATUS_2XX 27
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 201=27