benchmark/report/rps/full/20260804_164246/raw/032_download_1kb_c100_r1.txt
Running 20s test @ http://127.0.0.1:32781/api/files/by-hash/aa5f1510ea00def404be53790d32ec34fcebe5ec0341a47fa42f3164a14c0108/download
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   379.95ms   30.08ms 420.58ms   98.09%
    Req/Sec    36.65     26.98   121.00     73.05%
  Latency Distribution
     50%  383.49ms
     75%  386.18ms
     90%  388.80ms
     99%  396.46ms
  5022 requests in 20.09s, 7.82MB read
Requests/sec:    250.00
Transfer/sec:    398.68KB
HPS_WRK_REQUESTS 5022
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 5022
HPS_STATUS_2XX 5022
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 200=5022